<a href="https://colab.research.google.com/github/kushalvanama/INFO5731_Spring2020/blob/main/Vanama_INFO5731_Assignment_One_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **INFO5731 Assignment One**

# Question 1

(20 points). Write a Python program to generate 12 random numbers between 1 and 100. Sort the list of numbers in ascending order and print it out. Sort the list of numbers in descending order and print it out. Calculate the average for the group and print it out.

In [ ]:
# Your code here
import random

mylist = []

for i in range(0,12):
    x = random.randint(1,100)
    mylist.append(x)
print('Original list: ', mylist)

mylist.sort()
print('Ascending order: ', mylist)

mylist.sort(reverse=True)
print('Descending order: ', mylist)

avg = sum(mylist) / len(mylist)
print('Average is: ', round(avg,2))

Original list:  [38, 66, 70, 28, 95, 7, 66, 78, 15, 22, 79, 97]
Ascending order:  [7, 15, 22, 28, 38, 66, 66, 70, 78, 79, 95, 97]
Descending order:  [97, 95, 79, 78, 70, 66, 66, 38, 28, 22, 15, 7]
Average is:  55.08

# Question 2
(25 points). Write a program that will do the following string formatting tasks:

(1) Ask the user to enter two sentences.

(2) Make each sentence into a list. Each element in the list should correspond to a word in the sentence. For example, if the sentence is "Alas! Am I alive? This is my first python program", the program should print out ['Alas, '!', 'Am', 'I', 'alive, '?', 'This', 'is', 'my', 'first', 'python', 'program'].

(3) Compare the two sentences. Print out a list of words that occur in both sentences.

(4) Remove any punctuation from the sentence and print it back out. It should remove at least the following characters, but it can remove more: period(“.”), comma (“,”), semicolon (“;”), and colon (“:”)

(5) Count the number of vowels in the sentences. Print out each vowel and the number of times it appears in the sentences, such as: a:2, e:1, i:0, etc

In [ ]:
# Your code here
import re

st1 = input('Enter first sentence: ')
st2 = input('Enter second sentence: ')

l1 = re.split(r'([ .,!?;])', st1)
l2 = re.split(r'([ .,!?])', st2)
list1 = [ele for ele in l1 if ele.strip()] 
list2 = [ele for ele in l2 if ele.strip()]
print(list1, list2)

list3 = list(set(list1) & set(list2))
print('Common words: ', list3)

res_st1 = re.sub(r'[^\w\s]', '', st1) 
res_st2 = re.sub(r'[^\w\s]', '', st2)
print('First sentence without punctuation: ', res_st1, '\nSecond sentence without punctuation: ', res_st2)

Enter first sentence: hi, how are you?
Enter second sentence: hello, i am good, how aye y0ou?
['hi', ',', 'how', 'are', 'you', '?'] ['hello', ',', 'i', 'am', 'good', ',', 'how', 'aye', 'y0ou', '?']
Common words:  [',', '?', 'how']
First sentence without punctuation:  hi how are you
Second sentence without punctuation:  hello i am good how aye y0ou

# Question 3 

(15 points). The formula that describes the volume V of a sphere with radius r is the following:

$ V=\frac{4}{3}\ast\ \pi\ast\ r^3 $

Write a program to calculate the value of V when r is in the range of 1–10. Output the result in the following format:

	r	V
	1	…
	2	…
	3	…

In [ ]:
# Your code here
pi = 3.1415926535897931
print ('r V')
for r in range(1,11):
  V= 4.0/3.0*pi* r**3
  print(r,round(V,3))

r V
1 4.189
2 33.51
3 113.097
4 268.083
5 523.599
6 904.779
7 1436.755
8 2144.661
9 3053.628
10 4188.79

# Question 4

(40 points). In the field of Data Science, data is often formatted as a comma-delimited (CSV) file, where each line in a file corresponds to a field's value. Refer to Chapter 9 (p. 106) for more information on comma-delimited files. To answer this question, you will need to download the file [Assignment1_denton_housing.csv](https://github.com/unt-iialab/info5731_spring2021/blob/main/assignment/Assignment1_denton_housing.csv) included with this assignment. The file [Assignment1_denton_housing.csv](https://github.com/unt-iialab/info5731_spring2021/blob/main/assignment/Assignment1_denton_housing.csv) contains statistics about housing in the city of Denton from 2008 to 2014. Write a program to implement the following questions.

(1) (10 pts) Calculate the difference in the number of Occupied Housing Units from year to year and print it. The difference must be calculated for the consecutive years such as 2008-2009, 2009-2010 etc. Finally, print the values in the ascending order.


(2) (10 pts) For all the years, calculate the percentage of housing units which are vacant an occupied. Print the results in the following format:

Year Vacant Housing Units Occupied Housing Units

    2008  30%   70%                          
	2009 ----- -----
	2010 ----- -----
    2011 ----- -----
	2012 ----- -----
    2013 ----- -----
	2014 ----- -----
  
  

(3) (10 pts) Calculate and print the valued and years in which the highest number of housing units were vacant and occupied. Print the results in the following format:  

                              Year	Value
	Vacant Housing Units	  -----   -----
	Occupied Housing Units	-----   -----

(4) (10 pts) Calculate the harmonic mean of the total housing units and print it out. You can find the information about harmonic mean here: https://ncalculators.com/statistics/harmonic-mean-calculator.htm

In [ ]:
# Your code here

import pandas as pd
url = 'https://raw.githubusercontent.com/unt-iialab/info5731_spring2021/main/assignment/Assignment1_denton_housing.csv'
df = pd.read_csv(url, error_bad_lines=False)
df

    year             title_field  value
0   2014     Total Housing Units  49109
1   2014    Vacant Housing Units   2814
2   2014  Occupied Housing Units  46295
3   2013     Total Housing Units  47888
4   2013    Vacant Housing Units   4215
5   2013  Occupied Housing Units  43673
6   2012     Total Housing Units  45121
7   2012    Vacant Housing Units   3013
8   2012  Occupied Housing Units  42108
9   2011     Total Housing Units  44917
10  2011    Vacant Housing Units   4213
11  2011  Occupied Housing Units  40704
12  2010     Total Housing Units  44642
13  2010    Vacant Housing Units   3635
14  2010  Occupied Housing Units  41007
15  2009     Total Housing Units  39499
16  2009    Vacant Housing Units   3583
17  2009  Occupied Housing Units  35916
18  2008     Total Housing Units  41194
19  2008    Vacant Housing Units   4483
20  2008  Occupied Housing Units  36711
21  2014          Owner Occupied  21427
22  2014         Renter Occupied  24868
23  2013          Owner Occupied  20845
24  2013         Renter Occupied  22828
25  2012          Owner Occupied  20068
26  2012         Renter Occupied  22040
27  2011          Owner Occupied  18478
28  2011         Renter Occupied  22226
29  2010          Owner Occupied  18867
30  2010         Renter Occupied  22140
31  2009          Owner Occupied  18057
32  2009         Renter Occupied  17859
33  2008          Owner Occupied  17340
34  2008         Renter Occupied  19371
35  2014       Median Gross Rent    905
36  2013       Median Gross Rent    887
37  2012       Median Gross Rent    842
38  2011       Median Gross Rent    821
39  2010       Median Gross Rent    780
40  2009       Median Gross Rent    769
41  2008       Median Gross Rent    768

In [ ]:
x = df.loc[df['title_field']=='Occupied Housing Units']
x

    year             title_field  value
2   2014  Occupied Housing Units  46295
5   2013  Occupied Housing Units  43673
8   2012  Occupied Housing Units  42108
11  2011  Occupied Housing Units  40704
14  2010  Occupied Housing Units  41007
17  2009  Occupied Housing Units  35916
20  2008  Occupied Housing Units  36711

In [ ]:
df1 = x.sort_values(by = ['year'],ascending =True)
df1

    year             title_field  value
20  2008  Occupied Housing Units  36711
17  2009  Occupied Housing Units  35916
14  2010  Occupied Housing Units  41007
11  2011  Occupied Housing Units  40704
8   2012  Occupied Housing Units  42108
5   2013  Occupied Housing Units  43673
2   2014  Occupied Housing Units  46295

In [ ]:
result.sort_values(ascending= True)

17    -795.0
11    -303.0
8     1404.0
5     1565.0
2     2622.0
14    5091.0
20       NaN
Name: value, dtype: float64

In [ ]:
#(2)
import numpy as np
year = x.year
year_array = np.array(year)
x_value = x.value
Occupied = np.array(x_value)
x1 = df.loc[df['title_field']=='Vacant Housing Units']
Vacant = x1.value
x3 = df.loc[df['title_field']=='Total Housing Units']
x3_value = x3.value
Total = np.array(x3_value)
Occupied_percentage = Occupied/Total * 100
Vacant_percentage = Vacant/Total * 100
value = pd.DataFrame({'Year': year_array , 'Vacant Housing Units':Vacant_percentage,'Occupied Housing Units':Occupied_percentage })
print(value)

    Year  Vacant Housing Units  Occupied Housing Units
1   2014              5.730111               94.269889
4   2013              8.801788               91.198212
7   2012              6.677600               93.322400
10  2011              9.379522               90.620478
13  2010              8.142556               91.857444
16  2009              9.071116               90.928884
19  2008             10.882653               89.117347

In [ ]:
#(3)

a = df.groupby(['title_field'])['value'].transform(max) == df['value']
b= df[a]
b

    year             title_field  value
0   2014     Total Housing Units  49109
2   2014  Occupied Housing Units  46295
19  2008    Vacant Housing Units   4483
21  2014          Owner Occupied  21427
22  2014         Renter Occupied  24868
35  2014       Median Gross Rent    905

In [ ]:
df.loc[(df['title_field'] == 'Occupied Housing Units') | (df['title_field'] == 'Vacant Housing Units')]

    year             title_field  value
1   2014    Vacant Housing Units   2814
2   2014  Occupied Housing Units  46295
4   2013    Vacant Housing Units   4215
5   2013  Occupied Housing Units  43673
7   2012    Vacant Housing Units   3013
8   2012  Occupied Housing Units  42108
10  2011    Vacant Housing Units   4213
11  2011  Occupied Housing Units  40704
13  2010    Vacant Housing Units   3635
14  2010  Occupied Housing Units  41007
16  2009    Vacant Housing Units   3583
17  2009  Occupied Housing Units  35916
19  2008    Vacant Housing Units   4483
20  2008  Occupied Housing Units  36711

In [ ]:
#(4) Calculate the harmonic mean of the total housing units and print it out. You can find the information about harmonic mean here:

f2 = df.loc[df['title_field']=='Total Housing Units']
f2

    year          title_field  value
0   2014  Total Housing Units  49109
3   2013  Total Housing Units  47888
6   2012  Total Housing Units  45121
9   2011  Total Housing Units  44917
12  2010  Total Housing Units  44642
15  2009  Total Housing Units  39499
18  2008  Total Housing Units  41194

In [ ]:
!pip install scipy

Requirement already satisfied: scipy in /usr/local/lib/python3.6/dist-packages (1.4.1)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from scipy) (1.19.5)

In [ ]:
from scipy import stats
stats.hmean(f2.iloc[:,2],axis = 0)

44398.28543969185